Обработки/Reports/_ИтоговыйАктПоВводамВыводамИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ИтоговыйАктПоВводамВыводамИмущества</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжемесячныйАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгрузить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормирования</Name>
					<Comment>0 - по счету ДУ, 1 - по клиенту</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ИтоговыйАктПоВводамВыводамИмущества/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Отчет.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
	Отчет.Период.ДатаНачала = НачалоГода(Отчет.Период.ДатаОкончания);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Структура = Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант);
	Подписант = РаботаСОтчетами.ПолучитьКонтактноеЛицо(Структура);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	                             	
	Если СтруктураДанныхКонтактногоЛица = Неопределено Тогда 
		Подписант = Неопределено;		
	ИначеЕсли СтруктураДанныхКонтактногоЛица.Объект <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Организация, "ЮрФизЛицо") ИЛИ СтруктураДанныхКонтактногоЛица.КонтактноеЛицо <> Подписант Тогда
		// Если сохранен подписант другой организации, очистим подписанта		
		Подписант = Неопределено;
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	КонецЕсли;

	СчетДоверительногоУправленияПриИзменении(Неопределено);
			
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантОчистка(Элемент, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();
	
	Если Не ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Тогда
		Отчет.ЕжемесячныйАкт = Ложь;
		Элементы.ЕжемесячныйАкт.Видимость = Ложь;
		ОбновитьВидимость();
		Возврат;	
	КонецЕсли;
		
	УстановитьПериодПоУмолчанию();  	
	
	СчетДоверительногоУправленияПриИзмененииНаСервере();
	
	УстановитьИспользуемоеИмяФайла();
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура СчетДоверительногоУправленияПриИзмененииНаСервере()
	
	ЭтаФорма.ПодписантКлиента = "";
	ОбновитьТаблицуПодписантовКлиентаНаСервере();
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	ЭтоНПФ = ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
		Или ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами
		Или ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов;
		
	Отчет.Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Отчет.СчетДоверительногоУправления,	Отчет.Период.ДатаОкончания);
	Элементы.ЕжемесячныйАкт.Видимость = ЭтоНПФ;
	
	Если Не ЭтоНПФ И Отчет.ЕжемесячныйАкт Тогда
		Отчет.ЕжемесячныйАкт = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕжемесячныйАктПриИзменении(Элемент)
	
	УстановитьИспользуемоеИмяФайла();
	УстановитьПериодПоУмолчанию();
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПриИзменении(Элемент)
	
	Элементы.КаталогВыгрузки.Видимость = Отчет.Выгрузить;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Отчет.КаталогВыгрузки; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Отчет.КаталогВыгрузки = Диалог.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.КаталогВыгрузки + "\");
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ЭтаФорма.ПодписантКлиента = "";
	ПриИзмененииПараметровШапки();
	
	КлиентПриИзмененииНаСервере();
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	ОбновитьТаблицуПодписантовКлиентаНаСервере();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ЭтоНПФ = ОтчетОбъект.ЭтоНПФ();
	
	Если ЭтоНПФ = Неопределено Тогда
		Отчет.ЕжемесячныйАкт = Ложь;
		Элементы.ЕжемесячныйАкт.Видимость = Ложь;		
		Возврат;
	КонецЕсли;
	
	Элементы.ЕжемесячныйАкт.Видимость = ЭтоНПФ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

Процедура УстановитьИспользуемоеИмяФайла()
	
	Если Отчет.ЕжемесячныйАкт Тогда
		Элементы.Результат.ИспользуемоеИмяФайла = "Акт по вводам-выводам активов за " + Формат(Отчет.Период.ДатаНачала, "ДФ='MMMM yyyy'") + " " + СокрЛП(Отчет.СчетДоверительногоУправления) + ".xls";
	Иначе	
		Элементы.Результат.ИспользуемоеИмяФайла = "Итоговый акт по вводам-выводам активов с " + Формат(Отчет.Период.ДатаНачала, "ДЛФ=DD") + " по " + Формат(Отчет.Период.ДатаОкончания, "ДЛФ=DD") + ".xls";
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодПоУмолчанию()
	
	Если Не Отчет.ЕжемесячныйАкт И Отчет.Период.ДатаНачала <> НачалоГода(Отчет.Период.ДатаОкончания) Тогда
		// Спросим пользователя
		Если Вопрос("По умолчанию итоговый акт формируется за год. Установить формирование с начала года?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
		
	УстановитьПериодПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодПоУмолчаниюНаСервере()
	
	Если Не (ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Или ЗначениеЗаполнено(Отчет.Клиент)) Тогда
		Возврат;
	КонецЕсли;
							
	ТекДатаОкончания = Отчет.Период.ДатаОкончания;
	ТекДатаОкончания = ?(ТекДатаОкончания >= '20220131', ТекДатаОкончания, КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
	
	Если Отчет.ЕжемесячныйАкт Тогда
		
		Если Отчет.Период.ДатаНачала <> '00010101' 
				И Отчет.Период.ДатаОкончания <> '00010101' 
				И Отчет.Период.ДатаНачала = НачалоМесяца(Отчет.Период.ДатаНачала) 
				И Отчет.Период.ДатаОкончания = КонецМесяца(Отчет.Период.ДатаОкончания) 
				И Отчет.Период.ДатаНачала = НачалоМесяца(Отчет.Период.ДатаОкончания) Тогда
			Возврат;
		КонецЕсли;   		
		
		Отчет.Период.ДатаНачала = НачалоМесяца(ТекДатаОкончания);
		Отчет.Период.ДатаОкончания = КонецМесяца(ТекДатаОкончания);
	Иначе
		Отчет.Период.ДатаНачала = НачалоГода(ТекДатаОкончания);
		Отчет.Период.ДатаОкончания = КонецДня(ТекДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)
	
	Если Отчет.ВариантФормирования = 0 Тогда 
		СчетДоверительногоУправленияПриИзменении(Неопределено);
	Иначе
		КлиентПриИзменении(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.СчетДоверительногоУправления.Видимость 		= Отчет.ВариантФормирования = 0;
	Элементы.Клиент.Видимость 								= Отчет.ВариантФормирования = 1;	
		 	
	Элементы.КаталогВыгрузки.Видимость 	= Отчет.Выгрузить;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровШапки()
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПодписантовКлиентаНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ТаблицаПодписантов = ОтчетОбъект.ТаблицаПодписантовКлиента();
	Если ТаблицаПодписантов <> Неопределено Тогда
		ПодписантыКлиента.Загрузить(ТаблицаПодписантов);
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураПодписантаКлиента", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ((ЗначениеЗаполнено(Отчет.Клиент) Или ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления)) 
			И Отчет.Период.ДатаНачала <> '00010101' 
			И Отчет.Период.ДатаОкончания <> '00010101') Тогда			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала нужно выбрать период и счет доверительного управления (или клиента)");		
		Возврат;  		
	КонецЕсли;
	
	Если ПодписантыКлиента.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В анкете клиента не заполнены представители");
		Возврат;
	КонецЕсли; 
	
	ПараметрыОткрытия = ПолучитьПараметрыДляВыбораПодписантаКлиентаНаСервере();
	
	СтруктураПодписантаКлиента = ОткрытьФормуМодально("ВнешнийОтчет._ИтоговыйАктПоВводамВыводамИмущества.Форма.ФормаВыбораПодписантаКлиента", ПараметрыОткрытия);
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураПодписантаКлиента", СтруктураПодписантаКлиента);
		
	ЭтаФорма.ПодписантКлиента = ?(СтруктураПодписантаКлиента =  Неопределено, "", СтруктураПодписантаКлиента.Подписант);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляВыбораПодписантаКлиентаНаСервере()
	
	Возврат Новый Структура("Адрес", ПоместитьВоВременноеХранилище(ПодписантыКлиента.Выгрузить()));
	
КонецФункции

#КонецОбласти
